/*****************************************************************************/
/**
 * \file terminal.h
 *
 * \author Соколов Сергей <sokoloff@gmail.com>
 * \author Пащенко Андрей <temnislav@gmail.com>
 *
 * \date 05.01.2017
 * 
 * \brief Настройка UART и передача данных через него.
 *
 * \details Конфигурация UART для его последующей инициализации, создание
 *          прототипов функций для получение данных из конечных автоматов
 *          других модулей и передачи етих же данных в DMA, что реализова-
 *          но с помощью двух массивов.
 * - terminal_uart_init - конфигурация UART.
 * - terminal_uart_handler - копирование данных в дополнительный массив
 * array_data_dma  откуда они отпрвляются в UART и в DMA.
 * - наполнение массива mass_transmit_fifo данными присылаемыми конечными
 * автоматами других модулей.
 *****************************************************************************/

#ifndef _DELAY_H_
#define _DELAY_H_

/*****************************************************************************
 *                           Заголовочные файлы
 *****************************************************************************/

#include "stm32l0xx_hal.h"
#include "string.h"

/*****************************************************************************
 *                      Глобальные макрооопределения
 *****************************************************************************/

/*****************************************************************************
 *                         Глобальные типы данных
 *****************************************************************************/

/*****************************************************************************
 *                       Прототипы глобальных функций
 *****************************************************************************/

/*Конфигурируем UART с именем terminal_uart с необходимыми нам настройками*/
extern void terminal_uart_init(void);
/*Функция для передачи данных с автоматов через UART*/
extern void terminal_uart_handler(void);
/*Прототип функции для наполнения массива для последующей передачи данных, 
проверка на переполнение массива с отправкой сообщения об ошибке*/
extern void terminal_send_data(uint8_t *pData, uint16_t Size);

#endif // _TERMINAL_H_

/*****************************************************************************
 *                             Конец файла
 *****************************************************************************/